alert("Загадкова Історія Скайвокера в епоху Лицарства"); // Приветствие
alert("Початок шляху!");
let person = prompt("Вирушити в ліс, Піти через село, Відправитися до замку дракона"); //Задание перемеенных
let choice;
let tournament;
let kingTask;
//Блок выбора пути
if (person == "Вирушити в ліс") { // Разветвление на два исхода событий
    alert("Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку");
    choice = prompt("Прийняти зілля, Відмовитися"); // Запрос пользователя на действие
    if (choice == "Прийняти зілля") { // Итог на первое действие
        alert("Люк отримує надприродну силу, але залишається в боргу перед чарівницею.");
    } else { // Если первое не условие не сработало, выполняется это
        alert("Люк вибирає чесний шлях, відмовляючись від легкого успіху.");
    }
}
if (person === "Піти через село") { // Разветвление на два исхода событий
    alert(" Люк допомагає селянам, які потерпають від голови розбійників.");
    choice = prompt("Допомогти силою, Знайти мирне рішення"); // Запрос пользователя на действие
    if (choice == "Допомогти силою") {
        alert("Люк використовує силу для захисту селян, але отримує поранення.");
    } else { // Если первое не условие не сработало, выполняется это
        alert("Люк вирішує конфлікти миром, заробляючи повагу як лідера.");
    }
}
if (person === "Відправитися до замку дракона") { // Разветвление на два исхода событий
    alert(" Люк вирішує випробувати себе, викликаючи дракона на бій.");
    choice = prompt("Бій з драконом, Спроба перемовин"); // Запрос пользователя на действие
    if (choice == "Бій з драконом") {
        alert("Люк гине, але його ім'я вічно живе в легендах як символ непереможної сміливості та жертовності.");
    } else { // Если первое не условие не сработало, выполняется это
        alert("Люк дізнається, що дракон не хоче воювати, і вони досягають миру.");
    }
}

if (choice != "Бій з драконом") { // Отсекаем вариант если главный герой умер с честью
    alert("Після повернення з подорожей Люка викликають на турнір.");
}

tournament = prompt("Боротьба за честь,Допомога іншому учаснику,Відмова від бою"); // Запрос пользователя на действие

if (tournament == "Боротьба за честь") { // Исход действий в турнире
    alert("Люк демонструє свої навички, здобуваючи повагу.");
} else if (tournament == "Допомога іншому учаснику") {
    alert("Люк допомагає пораненому рицарю, показуючи своє серце.");
} else if (tournament == "Відмова від бою") {
    alert("Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати.");
}

alert("Король, вражений діями Люка, пропонує йому останнє завдання.")

kingTask = prompt("Захистити королівство,Пошук зниклої реліквії"); // Запрос пользователя на действие

if (kingTask == "Захистити королівство") { // Исход действий с королём
    alert("Люк веде війська проти ворога, демонструючи свою відвагу.");
} else {
    alert("Пошук зниклої реліквії: Люк вирушає за древньою реліквією, що може врятувати королівство.");
}

alert("Финал");
// Блок вывода финала истории
if (choice == "Відмовитися" && tournament == "Боротьба за честь") {
    alert("Люк стає рицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству.");
} else if (choice == "Знайти мирне рішення" && tournament == "Відмова від бою") {
    alert("Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті.");
} else if (choice == "Спроба перемовин" && kingTask == "Пошук зниклої реліквії") {
    alert("Люк доводить, що можна знайти мир навіть із драконами, і врятувати королівство без насильства, стаючи легендою.")
}







